Morphing_Ventricle_Ideal/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh dynamicMotionSolverFvMesh;  

motionSolverLibs ("libfvMotionSolvers.so");

motionSolver meshMotionFromDisk;

displacementLaplacianCoeffs
{
    diffusivity uniform;
}

meshMotionFromDiskCoeffs
{
    dispFilesDirectory "pointDisplacementFiles";
}
// ************************************************************************* //
