Morphing_Ventricle_Ideal/0/pointDisplacement
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    location    "0";
    object      pointDisplacement;
}

dimensions      [0 1 0 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
WALL
  {
    type calculated;
    value uniform (0 0 0);
  }
INLET
  {
    type calculated;
    value uniform (0 0 0);
  }
OUTLET
  {
    type calculated;
    value uniform (0 0 0);
  }
TUBES
  {
    type calculated;
    value uniform (0 0 0);
  }
}
